//位运算
//将数字的二进制数进行与或 异或(相同返回0 不同返回1) 取反(32位全部0变1 1变0 一般为原数字加一 加负号)
//左移（32位向左移动一位 右边用0 补齐） 右移（相当于去掉右边第一位）
//返回一个十进制数

//5 101
//3 011

//按二进制的位进行 与或非 如 5 & 3 则 1 & 1 返回1， 0 & 1 返回 0， 1 & 0 返回 0，
//最后结果为 001 转为十进制数 1 返回；

console.log("5 & 3", 5 & 3);
console.log("5 | 3", 5 | 3);
console.log("5 ^ 3", 5 ^ 3);
console.log("~5", ~5);
console.log("~3", ~3);

console.log("5<<1", 5 << 1);
console.log("5>>1", 5 >> 1);
console.log("-5>>>1", -5 >>> 1); //无符号右移

//回顾一下流程控制
console.clear();
var passcode = prompt("请输入暗号");
if (passcode === "天王盖地虎") {
  alert("登录成功");
} else {
  alert("登录失败");
}
